#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>
```

Success! The configuration is valid.


```
</details>
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Acquiring state lock. This may take a few moments...
data.google_service_account_access_token.default: Reading...
data.google_service_account_access_token.default: Read complete after 1s [id=projects/-/serviceAccounts/terraform@youtube-data-api-385206.iam.gserviceaccount.com]
data.google_service_account.terraform_sa: Reading...
google_service_account.app: Refreshing state... [id=projects/youtube-data-api-385206/serviceAccounts/youtube-data-api-sa@youtube-data-api-385206.iam.gserviceaccount.com]
google_iam_workload_identity_pool.mypool: Refreshing state... [id=projects/youtube-data-api-385206/locations/global/workloadIdentityPools/mypool]
google_service_account.invoker: Refreshing state... [id=projects/youtube-data-api-385206/serviceAccounts/cloudrun-invoker@youtube-data-api-385206.iam.gserviceaccount.com]
module.enable_google_apis.google_project_service.project_services["run.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/run.googleapis.com]
module.enable_google_apis.google_project_service.project_services["sts.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/sts.googleapis.com]
module.enable_google_apis.google_project_service.project_services["pubsub.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/pubsub.googleapis.com]
module.enable_google_apis.google_project_service.project_services["cloudscheduler.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/cloudscheduler.googleapis.com]
module.enable_google_apis.google_project_service.project_services["bigquery.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/bigquery.googleapis.com]
module.enable_google_apis.google_project_service.project_services["storage.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/storage.googleapis.com]
data.google_service_account.terraform_sa: Read complete after 0s [id=projects/youtube-data-api-385206/serviceAccounts/terraform@youtube-data-api-385206.iam.gserviceaccount.com]
module.enable_google_apis.google_project_service.project_services["artifactregistry.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/artifactregistry.googleapis.com]
module.enable_google_apis.google_project_service.project_services["iam.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/iam.googleapis.com]
module.enable_google_apis.google_project_service.project_services["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/cloudresourcemanager.googleapis.com]
module.enable_google_apis.google_project_service.project_services["iamcredentials.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/iamcredentials.googleapis.com]
google_project_iam_member.app[0]: Refreshing state... [id=youtube-data-api-385206/roles/bigquery.jobUser/serviceAccount:youtube-data-api-sa@youtube-data-api-385206.iam.gserviceaccount.com]
google_project_iam_member.app[4]: Refreshing state... [id=youtube-data-api-385206/roles/storage.objectCreator/serviceAccount:youtube-data-api-sa@youtube-data-api-385206.iam.gserviceaccount.com]
google_project_iam_member.app[5]: Refreshing state... [id=youtube-data-api-385206/roles/secretmanager.secretAccessor/serviceAccount:youtube-data-api-sa@youtube-data-api-385206.iam.gserviceaccount.com]
module.enable_google_apis.google_project_service.project_services["youtube.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/youtube.googleapis.com]
google_project_iam_member.app[1]: Refreshing state... [id=youtube-data-api-385206/roles/bigquery.dataEditor/serviceAccount:youtube-data-api-sa@youtube-data-api-385206.iam.gserviceaccount.com]
google_project_iam_member.app[2]: Refreshing state... [id=youtube-data-api-385206/roles/run.serviceAgent/serviceAccount:youtube-data-api-sa@youtube-data-api-385206.iam.gserviceaccount.com]
module.enable_google_apis.google_project_service.project_services["secretmanager.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/secretmanager.googleapis.com]
google_project_iam_member.invoker: Refreshing state... [id=youtube-data-api-385206/roles/run.invoker/serviceAccount:cloudrun-invoker@youtube-data-api-385206.iam.gserviceaccount.com]
google_project_iam_member.app[3]: Refreshing state... [id=youtube-data-api-385206/roles/pubsub.publisher/serviceAccount:youtube-data-api-sa@youtube-data-api-385206.iam.gserviceaccount.com]
google_iam_workload_identity_pool_provider.myprovider: Refreshing state... [id=projects/youtube-data-api-385206/locations/global/workloadIdentityPools/mypool/providers/myprovider]
google_service_account_iam_member.terraform_sa: Refreshing state... [id=projects/youtube-data-api-385206/serviceAccounts/terraform@youtube-data-api-385206.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/1051886801059/locations/global/workloadIdentityPools/mypool/attribute.repository/Kamegrueon/youtube_data_api]
google_pubsub_topic.main: Refreshing state... [id=projects/youtube-data-api-385206/topics/youtube-data-api]
google_storage_bucket.bucket: Refreshing state... [id=youtube-data-api-385206-youtube-data-api]
google_artifact_registry_repository.repository: Refreshing state... [id=projects/youtube-data-api-385206/locations/asia-northeast1/repositories/youtube-data-api-repository]
google_pubsub_topic_iam_member.topic_publisher_role: Refreshing state... [id=projects/youtube-data-api-385206/topics/youtube-data-api/roles/pubsub.publisher/serviceAccount:youtube-data-api-sa@youtube-data-api-385206.iam.gserviceaccount.com]
google_pubsub_topic.main_dead_letter: Refreshing state... [id=projects/youtube-data-api-385206/topics/youtube-data-api-dlq]
google_storage_bucket_iam_member.member: Refreshing state... [id=b/youtube-data-api-385206-youtube-data-api/roles/storage.admin/serviceAccount:youtube-data-api-sa@youtube-data-api-385206.iam.gserviceaccount.com]
google_cloud_run_v2_service.api: Refreshing state... [id=projects/youtube-data-api-385206/locations/asia-northeast1/services/youtube-data-api-api]
google_cloud_scheduler_job.invoke-transfer: Refreshing state... [id=projects/youtube-data-api-385206/locations/asia-northeast1/jobs/invoke-transfer]
google_pubsub_subscription.main: Refreshing state... [id=projects/youtube-data-api-385206/subscriptions/youtube-data-api-sub]
google_pubsub_subscription_iam_member.subscription_subscriber_role: Refreshing state... [id=projects/youtube-data-api-385206/subscriptions/youtube-data-api-sub/roles/pubsub.subscriber/serviceAccount:youtube-data-api-sa@youtube-data-api-385206.iam.gserviceaccount.com]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # google_cloud_run_v2_service.api has been deleted
  - resource "google_cloud_run_v2_service" "api" {
        id       = "projects/youtube-data-api-385206/locations/asia-northeast1/services/youtube-data-api-api"
      - location = "asia-northeast1" -> null
      - name     = "youtube-data-api-api" -> null
      - project  = "youtube-data-api-385206" -> null
        # (1 unchanged attribute hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_cloud_run_service_iam_member.api_invoker will be created
  + resource "google_cloud_run_service_iam_member" "api_invoker" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "asia-northeast1"
      + member   = "serviceAccount:cloudrun-invoker@youtube-data-api-385206.iam.gserviceaccount.com"
      + project  = "youtube-data-api-385206"
      + role     = "roles/run.invoker"
      + service  = "youtube-data-api-api"
    }

  # google_cloud_run_v2_service.api will be created
  + resource "google_cloud_run_v2_service" "api" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + effective_annotations   = (known after apply)
      + effective_labels        = (known after apply)
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = "INGRESS_TRAFFIC_INTERNAL_ONLY"
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "asia-northeast1"
      + name                    = "youtube-data-api-api"
      + observed_generation     = (known after apply)
      + project                 = "youtube-data-api-385206"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = (known after apply)
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)

      + template {
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = "youtube-data-api-sa@youtube-data-api-385206.iam.gserviceaccount.com"
          + timeout                          = (known after apply)

          + containers {
              + image = "asia-northeast1-docker.pkg.dev/youtube-data-api-385206/youtube-data-api-repository/youtube-data-api:2fd711b43d5b87f657b2f49958b681d7030e1f52"

              + env {
                  + name  = "GOOGLE_PROJECT_ID"
                  + value = "youtube-data-api-385206"
                }
              + env {
                  + name  = "PUBSUB_GENERATE_ANNOTATIONS_TOPIC"
                  + value = "youtube-data-api"
                }
              + env {
                  + name  = "CLOUD_STORAGE_BUCKET"
                  + value = "youtube-data-api-385206-youtube-data-api"
                }
              + env {
                  + name  = "YOUTUBE_API_SERVICE_NAME"
                  + value = "youtube"
                }
              + env {
                  + name  = "YOUTUBE_API_VERSION"
                  + value = "v3"
                }
              + env {
                  + name  = "SECRET_ID"
                  + value = "YOUTUBE_API_KEY"
                }
              + env {
                  + name  = "SECRET_YOUTUBE_API_VERSION"
                  + value = "1"
                }

              + resources {
                  + cpu_idle = true
                  + limits   = {
                      + "cpu"    = "1000m"
                      + "memory" = "1Gi"
                    }
                }
            }

          + scaling {
              + max_instance_count = 3
              + min_instance_count = 0
            }
        }

      + traffic {
          + percent = 100
          + type    = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST"
        }
    }

  # google_cloud_scheduler_job.invoke-transfer will be updated in-place
  ~ resource "google_cloud_scheduler_job" "invoke-transfer" {
        id               = "projects/youtube-data-api-385206/locations/asia-northeast1/jobs/invoke-transfer"
        name             = "invoke-transfer"
        # (8 unchanged attributes hidden)

      ~ http_target {
          ~ uri         = "https://youtube-data-api-api-jbgq7c2gfa-an.a.run.app/invoke/transfer" -> (known after apply)
            # (3 unchanged attributes hidden)

          ~ oidc_token {
              - audience              = "https://youtube-data-api-api-jbgq7c2gfa-an.a.run.app/invoke/transfer" -> null
                # (1 unchanged attribute hidden)
            }
        }

        # (1 unchanged block hidden)
    }

  # google_pubsub_subscription.main will be updated in-place
  ~ resource "google_pubsub_subscription" "main" {
        id                           = "projects/youtube-data-api-385206/subscriptions/youtube-data-api-sub"
        name                         = "youtube-data-api-sub"
        # (11 unchanged attributes hidden)

      ~ push_config {
          ~ push_endpoint = "https://youtube-data-api-api-jbgq7c2gfa-an.a.run.app/invoke/load" -> (known after apply)
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 2 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @Kamegrueon, Action: `pull_request`, Working Directory: ``, Workflow: `cicd`*